solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/codec/wm8960/fsl_wm8960.c
    /*
     * Digital DAC volume, -15.5dB
     */
    WM8960_CHECK_RET(WM8960_WriteReg(handle, WM8960_LDAC, 0x1E0), ret);
    WM8960_CHECK_RET(WM8960_WriteReg(handle, WM8960_RDAC, 0x1E0), ret);

    /*
     * Headphone volume, LOUT1 and ROUT1, -10dB
     */
    WM8960_CHECK_RET(WM8960_WriteReg(handle, WM8960_LOUT1, 0x16F), ret);
    WM8960_CHECK_RET(WM8960_WriteReg(handle, WM8960_ROUT1, 0x16F), ret);

    /* speaker volume 6dB */
    WM8960_CHECK_RET(WM8960_WriteReg(handle, WM8960_LOUT2, 0x1ff), ret);
    WM8960_CHECK_RET(WM8960_WriteReg(handle, WM8960_ROUT2, 0x1ff), ret);
    /* enable class D output */
    WM8960_CHECK_RET(WM8960_WriteReg(handle, WM8960_CLASSD1, 0xf7), ret);

    /* Unmute DAC. */
    WM8960_CHECK_RET(WM8960_WriteReg(handle, WM8960_DACCTL1, 0x0000), ret);
    WM8960_CHECK_RET(WM8960_WriteReg(handle, WM8960_LINVOL, 0x117), ret);
    WM8960_CHECK_RET(WM8960_WriteReg(handle, WM8960_RINVOL, 0x117), ret);

    WM8960_CHECK_RET(WM8960_ConfigDataFormat(handle, sysclk, config->format.sampleRate, config->format.bitWidth), ret);

    return ret;
}

status_t WM8960_Deinit(wm8960_handle_t *handle)
{
    status_t ret = kStatus_Success;

    WM8960_CHECK_RET(WM8960_SetModule(handle, kWM8960_ModuleADC, false), ret);
    WM8960_CHECK_RET(WM8960_SetModule(handle, kWM8960_ModuleDAC, false), ret);
    WM8960_CHECK_RET(WM8960_SetModule(handle, kWM8960_ModuleVREF, false), ret);
    WM8960_CHECK_RET(WM8960_SetModule(handle, kWM8960_ModuleLineIn, false), ret);
    WM8960_CHECK_RET(WM8960_SetModule(handle, kWM8960_ModuleLineOut, false), ret);
    WM8960_CHECK_RET(WM8960_SetModule(handle, kWM8960_ModuleSpeaker, false), ret);

    return ret;
}

void WM8960_SetMasterSlave(wm8960_handle_t *handle, bool master)
{
    if (master)
    {
        (void)WM8960_ModifyReg(handle, WM8960_IFACE1, WM8960_IFACE1_MS_MASK, WM8960_IFACE1_MS(WM8960_IFACE1_MASTER));
    }
    else
    {
        (void)WM8960_ModifyReg(handle, WM8960_IFACE1, WM8960_IFACE1_MS_MASK, WM8960_IFACE1_MS(WM8960_IFACE1_SLAVE));
    }
}

status_t WM8960_SetModule(wm8960_handle_t *handle, wm8960_module_t module, bool isEnabled)
{
    status_t ret = kStatus_Success;
    switch (module)
    {
        case kWM8960_ModuleADC:
            WM8960_CHECK_RET(WM8960_ModifyReg(handle, WM8960_POWER1, WM8960_POWER1_ADCL_MASK,
                                              ((uint16_t)isEnabled << WM8960_POWER1_ADCL_SHIFT)),
                             ret);
            WM8960_CHECK_RET(WM8960_ModifyReg(handle, WM8960_POWER1, WM8960_POWER1_ADCR_MASK,
                                              ((uint16_t)isEnabled << WM8960_POWER1_ADCR_SHIFT)),
                             ret);
            break;
        case kWM8960_ModuleDAC:
            WM8960_CHECK_RET(WM8960_ModifyReg(handle, WM8960_POWER2, WM8960_POWER2_DACL_MASK,
                                              ((uint16_t)isEnabled << WM8960_POWER2_DACL_SHIFT)),
                             ret);
            WM8960_CHECK_RET(WM8960_ModifyReg(handle, WM8960_POWER2, WM8960_POWER2_DACR_MASK,
                                              ((uint16_t)isEnabled << WM8960_POWER2_DACR_SHIFT)),
                             ret);
            break;
        case kWM8960_ModuleVREF:
            WM8960_CHECK_RET(WM8960_ModifyReg(handle, WM8960_POWER1, WM8960_POWER1_VREF_MASK,
                                              ((uint16_t)isEnabled << WM8960_POWER1_VREF_SHIFT)),
                             ret);
            break;
        case kWM8960_ModuleLineIn:
            WM8960_CHECK_RET(WM8960_ModifyReg(handle, WM8960_POWER1, WM8960_POWER1_AINL_MASK,
                                              ((uint16_t)isEnabled << WM8960_POWER1_AINL_SHIFT)),
                             ret);
            WM8960_CHECK_RET(WM8960_ModifyReg(handle, WM8960_POWER1, WM8960_POWER1_AINR_MASK,
                                              ((uint16_t)isEnabled << WM8960_POWER1_AINR_SHIFT)),
                             ret);
            WM8960_CHECK_RET(WM8960_ModifyReg(handle, WM8960_POWER3, WM8960_POWER3_LMIC_MASK,
                                              ((uint16_t)isEnabled << WM8960_POWER3_LMIC_SHIFT)),
                             ret);
            WM8960_CHECK_RET(WM8960_ModifyReg(handle, WM8960_POWER3, WM8960_POWER3_RMIC_MASK,
                                              ((uint16_t)isEnabled << WM8960_POWER3_RMIC_SHIFT)),
                             ret);
            break;
        case kWM8960_ModuleLineOut:
            WM8960_CHECK_RET(WM8960_ModifyReg(handle, WM8960_POWER2, WM8960_POWER2_LOUT1_MASK,
                                              ((uint16_t)isEnabled << WM8960_POWER2_LOUT1_SHIFT)),
                             ret);
            WM8960_CHECK_RET(WM8960_ModifyReg(handle, WM8960_POWER2, WM8960_POWER2_ROUT1_MASK,
                                              ((uint16_t)isEnabled << WM8960_POWER2_ROUT1_SHIFT)),
                             ret);
            break;
        case kWM8960_ModuleMICB:
            WM8960_CHECK_RET(WM8960_ModifyReg(handle, WM8960_POWER1, WM8960_POWER1_MICB_MASK,
                                              ((uint16_t)isEnabled << WM8960_POWER1_MICB_SHIFT)),
                             ret);
            break;
        case kWM8960_ModuleSpeaker:
            WM8960_CHECK_RET(WM8960_ModifyReg(handle, WM8960_POWER2, WM8960_POWER2_SPKL_MASK,
                                              ((uint16_t)isEnabled << WM8960_POWER2_SPKL_SHIFT)),
                             ret);
            WM8960_CHECK_RET(WM8960_ModifyReg(handle, WM8960_POWER2, WM8960_POWER2_SPKR_MASK,
                                              ((uint16_t)isEnabled << WM8960_POWER2_SPKR_SHIFT)),
                             ret);
            WM8960_CHECK_RET(WM8960_WriteReg(handle, WM8960_CLASSD1, 0xF7), ret);
            break;
        case kWM8960_ModuleOMIX:
            WM8960_CHECK_RET(WM8960_ModifyReg(handle, WM8960_POWER3, WM8960_POWER3_LOMIX_MASK,
                                              ((uint16_t)isEnabled << WM8960_POWER3_LOMIX_SHIFT)),
                             ret);
            WM8960_CHECK_RET(WM8960_ModifyReg(handle, WM8960_POWER3, WM8960_POWER3_ROMIX_MASK,
                                              ((uint16_t)isEnabled << WM8960_POWER3_ROMIX_SHIFT)),
                             ret);
            break;
        default:
            ret = kStatus_InvalidArgument;
            break;
    }
    return ret;
}

