solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/codec/wm8960/fsl_wm8960.c
    switch (input)
    {
        case kWM8960_InputClosed:
            WM8960_CHECK_RET(WM8960_ReadReg(WM8960_POWER1, &val), ret);
            val &= (uint16_t) ~(WM8960_POWER1_AINR_MASK | WM8960_POWER1_ADCR_MASK);
            WM8960_CHECK_RET(WM8960_WriteReg(handle, WM8960_POWER1, val), ret);
            break;
        case kWM8960_InputSingleEndedMic:
            /* Only LMN1 enabled, LMICBOOST to 13db, LMIC2B enabled */
            WM8960_CHECK_RET(WM8960_ReadReg(WM8960_POWER1, &val), ret);
            val |= (WM8960_POWER1_AINR_MASK | WM8960_POWER1_ADCR_MASK | WM8960_POWER1_MICB_MASK);
            WM8960_CHECK_RET(WM8960_WriteReg(handle, WM8960_POWER1, val), ret);
            WM8960_CHECK_RET(WM8960_WriteReg(handle, WM8960_RINPATH, 0x138), ret);
            WM8960_CHECK_RET(WM8960_WriteReg(handle, WM8960_RINVOL, 0x117), ret);
            break;
        case kWM8960_InputDifferentialMicInput2:
            WM8960_CHECK_RET(WM8960_ReadReg(WM8960_POWER1, &val), ret);
            val |= (WM8960_POWER1_AINR_MASK | WM8960_POWER1_ADCR_MASK | WM8960_POWER1_MICB_MASK);
            WM8960_CHECK_RET(WM8960_WriteReg(handle, WM8960_POWER1, val), ret);
            WM8960_CHECK_RET(WM8960_WriteReg(handle, WM8960_RINPATH, 0x178), ret);
            WM8960_CHECK_RET(WM8960_WriteReg(handle, WM8960_RINVOL, 0x117), ret);
            break;
        case kWM8960_InputDifferentialMicInput3:
            WM8960_CHECK_RET(WM8960_ReadReg(WM8960_POWER1, &val), ret);
            val |= (WM8960_POWER1_AINR_MASK | WM8960_POWER1_ADCR_MASK | WM8960_POWER1_MICB_MASK);
            WM8960_CHECK_RET(WM8960_WriteReg(handle, WM8960_POWER1, val), ret);
            WM8960_CHECK_RET(WM8960_WriteReg(handle, WM8960_RINPATH, 0x1B8), ret);
            WM8960_CHECK_RET(WM8960_WriteReg(handle, WM8960_RINVOL, 0x117), ret);
            break;
        case kWM8960_InputLineINPUT2:
            WM8960_CHECK_RET(WM8960_ReadReg(WM8960_POWER1, &val), ret);
            val |= (WM8960_POWER1_AINR_MASK | WM8960_POWER1_ADCR_MASK);
            WM8960_CHECK_RET(WM8960_WriteReg(handle, WM8960_POWER1, val), ret);
            WM8960_CHECK_RET(WM8960_ReadReg(WM8960_INBMIX2, &val), ret);
            val |= 0xEU;
            WM8960_CHECK_RET(WM8960_WriteReg(handle, WM8960_INBMIX2, val), ret);
            break;
        case kWM8960_InputLineINPUT3:
            WM8960_CHECK_RET(WM8960_ReadReg(WM8960_POWER1, &val), ret);
            val |= (WM8960_POWER1_AINR_MASK | WM8960_POWER1_ADCR_MASK);
            WM8960_CHECK_RET(WM8960_WriteReg(handle, WM8960_POWER1, val), ret);
            WM8960_CHECK_RET(WM8960_ReadReg(WM8960_INBMIX2, &val), ret);
            val |= 0x70U;
            WM8960_CHECK_RET(WM8960_WriteReg(handle, WM8960_INBMIX2, val), ret);
            break;
        default:
            ret = kStatus_InvalidArgument;
            break;
    }

    return ret;
}

status_t WM8960_SetProtocol(wm8960_handle_t *handle, wm8960_protocol_t protocol)
{
    return WM8960_ModifyReg(handle, WM8960_IFACE1, WM8960_IFACE1_FORMAT_MASK | WM8960_IFACE1_LRP_MASK,
                            (uint16_t)protocol);
}

status_t WM8960_SetVolume(wm8960_handle_t *handle, wm8960_module_t module, uint32_t volume)
{
    uint16_t vol = 0;
    status_t ret = kStatus_Success;
    switch (module)
    {
        case kWM8960_ModuleADC:
            if (volume > 255U)
            {
                ret = kStatus_InvalidArgument;
            }
            else
            {
                vol = (uint16_t)volume;
                WM8960_CHECK_RET(WM8960_WriteReg(handle, WM8960_LADC, vol), ret);
                WM8960_CHECK_RET(WM8960_WriteReg(handle, WM8960_RADC, vol), ret);
                /* Update volume */
                vol = (uint16_t)(0x100U | volume);
                WM8960_CHECK_RET(WM8960_WriteReg(handle, WM8960_LADC, vol), ret);
                WM8960_CHECK_RET(WM8960_WriteReg(handle, WM8960_RADC, vol), ret);
            }
            break;
        case kWM8960_ModuleDAC:
            if (volume > 255U)
            {
                ret = kStatus_InvalidArgument;
            }
            else
            {
                vol = (uint16_t)volume;
                WM8960_CHECK_RET(WM8960_WriteReg(handle, WM8960_LDAC, vol), ret);
                WM8960_CHECK_RET(WM8960_WriteReg(handle, WM8960_RDAC, vol), ret);
                vol = 0x100U | (uint16_t)volume;
                WM8960_CHECK_RET(WM8960_WriteReg(handle, WM8960_LDAC, vol), ret);
                WM8960_CHECK_RET(WM8960_WriteReg(handle, WM8960_RDAC, vol), ret);
            }
            break;
        case kWM8960_ModuleHP:
            if (volume > 0x7FU)
            {
                ret = kStatus_InvalidArgument;
            }
            else
            {
                vol = (uint16_t)volume;
                WM8960_CHECK_RET(WM8960_WriteReg(handle, WM8960_LOUT1, vol), ret);
                WM8960_CHECK_RET(WM8960_WriteReg(handle, WM8960_ROUT1, vol), ret);
                vol = 0x100U | (uint16_t)volume;
                WM8960_CHECK_RET(WM8960_WriteReg(handle, WM8960_LOUT1, vol), ret);
                WM8960_CHECK_RET(WM8960_WriteReg(handle, WM8960_ROUT1, vol), ret);
            }
            break;
        case kWM8960_ModuleLineIn:
            if (volume > 0x3FU)
            {
                ret = kStatus_InvalidArgument;
            }
            else
            {
                vol = (uint16_t)volume;
                WM8960_CHECK_RET(WM8960_WriteReg(handle, WM8960_LINVOL, vol), ret);
                WM8960_CHECK_RET(WM8960_WriteReg(handle, WM8960_RINVOL, vol), ret);
                vol = 0x100U | (uint16_t)volume;
                WM8960_CHECK_RET(WM8960_WriteReg(handle, WM8960_LINVOL, vol), ret);
                WM8960_CHECK_RET(WM8960_WriteReg(handle, WM8960_RINVOL, vol), ret);
            }
            break;
        case kWM8960_ModuleSpeaker:
            if (volume > 0x7FU)
            {
                ret = kStatus_InvalidArgument;
            }
            else
            {
                vol = (uint16_t)volume;
                WM8960_CHECK_RET(WM8960_WriteReg(handle, WM8960_LOUT2, vol), ret);
                WM8960_CHECK_RET(WM8960_WriteReg(handle, WM8960_ROUT2, vol), ret);
                vol = 0x100U | (uint16_t)volume;
                WM8960_CHECK_RET(WM8960_WriteReg(handle, WM8960_LOUT2, vol), ret);
                WM8960_CHECK_RET(WM8960_WriteReg(handle, WM8960_ROUT2, vol), ret);
            }
            break;
        default:
            ret = kStatus_InvalidArgument;
            break;
    }
    return ret;
}

uint32_t WM8960_GetVolume(wm8960_handle_t *handle, wm8960_module_t module)
{
    uint16_t vol = 0;

